backend/app/controllers/levels_controller.rb

  def index
    language = params[:language] || 'en'
    levels = Level.all

    Rails.logger.info "Levels found: #{levels.count}"
    Rails.logger.info "Language requested: #{language}"

    result = levels.map do |level|
---
SELECT "levels".* FROM "levels"
SELECT COUNT(*) FROM "levels"
SELECT "levels".* FROM "levels" ORDER BY "levels"."id" ASC