backend/app/controllers/projects_controller.rb

  def index
    language = params[:language] || 'en'
    projects = Project.all

    Rails.logger.info "Projects found: #{projects.count}"
    Rails.logger.info "Language requested: #{language}"

    result = projects.map do |project|
---
SELECT "projects".* FROM "projects"
SELECT COUNT(*) FROM "projects"